BaseConfiguration/Money_2_0/InformationRegisters/ПакетыСинхронизацииПолученные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПакетыСинхронизацииПолученные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПакетовСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЧастей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Comment>Дата выгрузки пакета на сервере</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелКорреспондента</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияАвтономныхКопий</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПакетаКПолучению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЧастиПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ПакетыСинхронизацииПолученные/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//

#Область ПрограммныйИнтерфейс

// Возвращает массив структур с описанием частей полученного пакета для указанного узла
//
//Параметры:
//	Узел - ПланОбменаСсылка
//
//Возвращаемое значение:
//	ТаблицаЗначений
//
Функция ОчередьПакетовДляУзла(Узел, НомерПакета = Неопределено, ДляСериализации = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("НомерПакета", ?(ЗначениеЗаполнено(НомерПакета), НомерПакета, Неопределено));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетыСинхронизацииПолученные.УзелКорреспондента КАК УзелКорреспондента,
	|	ПакетыСинхронизацииПолученные.УзелКорреспондента.Код КАК КодУзла,
	|	ПакетыСинхронизацииПолученные.НомерПакетаКПолучению КАК НомерПакетаКПолучению,
	|	ПакетыСинхронизацииПолученные.НомерЧастиПакета КАК НомерЧастиПакета,
	|	ПакетыСинхронизацииПолученные.ВсегоЧастей КАК ВсегоЧастей,
	|	ПакетыСинхронизацииПолученные.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ПакетыСинхронизацииПолученные.ТипПакета КАК ТипПакета
	|ИЗ
	|	РегистрСведений.ПакетыСинхронизацииПолученные КАК ПакетыСинхронизацииПолученные
	|ГДЕ
	|	ПакетыСинхронизацииПолученные.УзелКорреспондента = &Узел
	|	И (&НомерПакета = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПакетыСинхронизацииПолученные.НомерПакетаКПолучению = &НомерПакета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПакетаКПолучению,
	|	НомерЧастиПакета";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если ДляСериализации Тогда
		Результат.Колонки.Добавить("ДатаВыгрузкиСтрокой");
		Результат.Колонки.Добавить("ТипПакетаСтрокой");
		Для каждого Строка Из Результат Цикл
			Строка.ДатаВыгрузкиСтрокой = Формат(Строка.ДатаВыгрузки, "ДФ=ггггММддЧЧммсс");
			Если ЗначениеЗаполнено(Строка.ТипПакета) Тогда
				Строка.ТипПакетаСтрокой    = ОбщегоНазначения.ИмяЗначенияПеречисления(Строка.ТипПакета);
			КонецЕсли;
		КонецЦикла;
		Результат.Колонки.Удалить("УзелКорреспондента");
		Результат.Колонки.Удалить("ДатаВыгрузки");
		Результат.Колонки.ДатаВыгрузкиСтрокой.Имя = "ДатаВыгрузки";
		Результат.Колонки.Удалить("ТипПакета");
		Результат.Колонки.ТипПакетаСтрокой.Имя = "ТипПакета";
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает структуру с инфорамцией о файлах, полученных от узла
//
//Параметры:
//	Узел - ПланОбменаСсылка
//	НомерПакета - Число - значение измерения НомерПакетаКПолучению
//
//Возвращаемое значение:
//	Структура
//		* КоличествоПолучено  - Число
//		* КоличествоВсего - Число
//		* ПолученныеЧасти - Массив структур с описанием частей
//
Функция ИнформацияОПолученныхПакетах(Узел, НомерПакета) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоПолучено", 0); 
	Результат.Вставить("КоличествоВсего", 0); 
	Результат.Вставить("ПолученныеЧасти", Новый Массив); 
	
	Набор = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(Узел);
	Набор.Отбор.НомерПакетаКПолучению.Установить(НомерПакета);
	Набор.Прочитать();
	
	Результат.КоличествоПолучено = Набор.Количество();
	Для каждого Запись Из Набор Цикл
		
		СтруктураЗаписи = Новый Структура("НомерПакета,НомерЧастиПакета,ТипПакета,ВсегоЧастей,ДатаВыгрузки");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		СтруктураЗаписи.НомерПакета = Запись.НомерПакетаКПолучению;
		Если Не ЗначениеЗаполнено(Запись.ТипПакета) Тогда
			СтруктураЗаписи.ТипПакета = "";
		Иначе
			СтруктураЗаписи.ТипПакета = ОбщегоНазначения.ИмяЗначенияПеречисления(Запись.ТипПакета);
		КонецЕсли;
		Результат.ПолученныеЧасти.Добавить(СтруктураЗаписи);
		Если Результат.КоличествоВсего = 0 Тогда
			Результат.КоличествоВсего = СтруктураЗаписи.ВсегоЧастей;
		КонецЕсли;
		
	КонецЦикла;
	
	Набор = Неопределено;
	Возврат Результат;
	
КонецФункции 

// Удаляет записи для указанных узла и номера пакета
//
//Параметры:
//	Узел - ПланОбменаСсылка
//	НомерПакета - Число - значение измерения НомерПакетаКОтправке
//
Процедура УдалитьПакеты(Узел, НомерПакета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("НомерПакета", ?(ЗначениеЗаполнено(НомерПакета), НомерПакета, Неопределено));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПакетыСинхронизацииПолученные.УзелКорреспондента КАК УзелКорреспондента,
	|	ПакетыСинхронизацииПолученные.НомерПакетаКПолучению КАК НомерПакетаКПолучению
	|ИЗ
	|	РегистрСведений.ПакетыСинхронизацииПолученные КАК ПакетыСинхронизацииПолученные
	|ГДЕ
	|	ПакетыСинхронизацииПолученные.УзелКорреспондента = &Узел
	|	И (&НомерПакета = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПакетыСинхронизацииПолученные.НомерПакетаКПолучению <= &НомерПакета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПакетаКПолучению";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьНаборЗаписей();
		Набор.Отбор.УзелКорреспондента.Установить(Выборка.УзелКорреспондента);
		Набор.Отбор.НомерПакетаКПолучению.Установить(Выборка.НомерПакетаКПолучению);
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

//
#КонецЕсли
